Repository: davidpovarsky/Maktabah
Catalog: Source/Localizable.xcstrings
Source language: en
Languages: ar, he, id

source: Filter by Books…
ar: تصفية حسب الكتب...
he: סינון לפי ספרים…
id: Filter berdasarkan Kitab…

# .ftsMigrationAlertMessage
source: You can always update the index later from Settings.
ar: يمكنك دائمًا تحديث المؤشر لاحقًا من الإعدادات.
id: Pembaruan indeks selalu tersedia di Pengaturan.

# .ftsMigrationAlertTitle
source: Index Update
ar: تحديث المؤشر
id: Pembaruan Indeks

# .ftsMigrationAvailable
source: FTS Search Upgrade (Light10 Stemming) is available.
ar: تحديث البحث FTS (Light10 Stemming) متاح.
id: Peningkatan pencarian FTS (Light10 Stemming) tersedia.

# .ftsMigrationAvailableBook
source: Search upgrade is available for this book.
ar: تحديث البحث متاح لهذا الكتاب.
id: Peningkatan pencarian tersedia untuk buku ini.

# .ftsMigrationCancelBtn
source: Cancel
ar: إلغاء
id: Batal

# .ftsMigrationDesc
source: This upgrade introduces Light10 Stemming, allowing you to search Arabic text by ignoring common prefixes and suffixes.
ar: تقدم هذه الترقية تقنية Light10 Stemming، مما يتيح لك البحث في النص العربي مع تجاهل السوابق واللواحق الشائعة.
id: Peningkatan ini menggunakan Light10 Arabic Stemming, memungkinkan pencarian dengan mengabaikan awalan dan akhiran umum.

# .ftsMigrationExample
source: Example: Searching for "كتب" will also find "وكتب", "فكتب", "الكتب", etc.
ar: مثال: البحث عن "كتب" سيجد أيضاً "وكتب"، "فكتب"، "الكتب"، إلخ.
id: Contoh: Mencari "كتب" juga akan menemukan "وكتب", "فكتب", "الكتب", dll.

# .ftsMigrationHideBannerBtn
source: Don't show again
ar: لا تظهر مرة أخرى
id: Jangan tampilkan lagi

# .ftsMigrationStatus
source: Updating Archive %1$lld/%2$lld — Book %3$lld/%4$lld (%5$lld%%)
ar: تحديث الأرشيف %1$lld/%2$lld — الكتاب %3$lld/%4$lld (%5$lld%%)
id: Memperbarui Arsip %1$lld/%2$lld — Buku %3$lld/%4$lld (%5$lld%%)

# .ftsMigrationStatusBook
source: Updating Archive — Book %1$lld/%2$lld (%3$lld%%)
ar: تحديث الأرشيف — الكتاب %1$lld/%2$lld (%3$lld%%)
id: Memperbarui Arsip — Buku %1$lld/%2$lld (%3$lld%%)

# .ftsMigrationTitle
source: Search Engine Upgrade
ar: ترقية محرك البحث
id: Peningkatan Mesin Pencari

# .ftsMigrationUpdateBtn
source: Update Now
ar: تحديث الآن
id: Perbarui Sekarang

# .ftsMigrationUpdateIndexBtn
source: Update Index (%1$lld archives)
ar: تحديث الفهرس (%1$lld أرشيف)
id: Perbarui Indeks (%1$lld arsip)

# .ftsMigrationUpdateNowCountBtn
source: Update Now (%1$lld archives)
ar: تحديث الآن (%1$lld أرشيف)
id: Perbarui Sekarang (%1$lld arsip)

# .ftsMigrationUpToDate
source: Search index is up to date ✓
ar: فهرس البحث محدث ✓
id: Indeks pencarian sudah yang terbaru ✓

source: More Options
ar: المزيد من الخيارات
he: אפשרויות נוספות
id: Lainnya

# .noMetadata
source: There was no information
ar: لم توجد المعلومات
id: Tidak ada informasi

# '%@' already exists. All annotations from '%@' will be merged into '%@'.
source: '%1$@' already exists. All annotations from '%2$@' will be merged into '%3$@'.
ar: '%1$@' موجود بالفعل. سيتم دمج جميع التعليقات من '%2$@' في '%3$@'.
he: '%1$@' כבר קיים. כל ההערות מ־'%2$@' ימוזגו לתוך '%3$@'.
id: '%1$@' sudah ada. Semua anotasi dari '%2$@' akan digabungkan ke dalam '%3$@'.

source: "%@" and all its contents will be permanently deleted.
ar: سيتم حذف "%@" وجميع محتوياته نهائيًا.
he: "%@" וכל התוכן שלו יימחקו לצמיתות.
id: "%@" dan semua isinya akan dihapus secara permanen.

# %lld / %lld buku
source: %1$lld / %2$lld book
ar: %1$lld / %2$lld كتابا
id: %1$lld / %2$lld buku

source: %lld Annotations Exist
ar: يوجد %lld تعليق توضيحي
he: קיימות %lld הערות
id: %lld Anotasi Ditemukan

source: %lld book selected
ar: %lld الكتب المحددة
he: נבחרו %lld ספרים
id: %lld kitab terpilih

source: %lld books needs updates
ar: %lld كتب بحاجة إلى تحديثات
he: %lld ספרים זקוקים לעדכון
id: %lld kitab perlu diperbarui

source: %lld books to download.
ar: %lld كتب للتنزيل.
he: %lld ספרים להורדה.
id: %lld kitab untuk diunduh.

# %lld completed, %lld failed.
source: %1$lld completed, %2$lld failed.
ar: %1$lld اكتمل, %2$lld فشل.
he: %1$lld הושלמו, %2$lld נכשלו.
id: %1$lld berhasil, %2$lld gagal.

source: A
ar: أ

source: Access Needed
ar: يتطلب التطبيق الوصول إلى مجلد قاعدة البيانات للمتابعة.
he: נדרשת גישה
id: Akses Diperlukan

source: Add Favorite
ar: إضافة إلى المفضلة
he: הוסף למועדפים
id: Tambah Favorit

source: Add Note
ar: إنشاء الملاحظة
he: הוסף הערה
id: Tambahkan Catatan

source: Add Tags
ar: إضافة علامات
he: הוסף תגיות
id: Tambahkan Tag

source: All
ar: كل
he: הכל
id: Semua

source: All %lld books processed successfully.
ar: تمت معالجة جميع كتب %lld بنجاح.
he: כל %lld הספרים עובדו בהצלחה.
id: Semua %lld kitab berhasil diproses.

# All Anotations
source: All Annotations
ar: كل التعليقات التوضيحية
he: כל ההערות
id: Semua Anotasi

source: All books are up to date
ar: جميع الكتب محدثة
he: כל הספרים מעודכנים
id: Semua kitab sudah terbaru

source: Already updated
ar: مُحدَّث بالفعل
he: כבר מעודכן
id: Sudah terbaru

source: annotation
ar: التعليق
he: הערה
id: Anotasi

# annotationMoveFolderFileExistsTitle
source: Existing Annotations Found
ar: تم العثور على التعليقات التوضيحية الحالية
he: נמצאו הערות קיימות
id: Anotasi Yang Ada Ditemukan

source: Annotations
ar: التعليقات
he: הערות
id: Anotasi

source: Annotations & Search Results
ar: التعليقات ونتائج البحث
he: הערות ותוצאות חיפוש
id: Anotasi & Hasil Pencarian

# annotationsMoveFolderFileExistsDesc
source: Annotations already exist in the destination folder. Would you like to keep them (and delete the old ones) or overwrite them with the old ones?
ar: التعليقات التوضيحية موجودة بالفعل في مجلد الوجهة. هل ترغب في الاحتفاظ بها (وحذف القديمة) أو الكتابة فوقها بالقديمة؟
he: כבר קיימות הערות בתיקיית היעד. האם לשמור אותן (ולמחוק את הישנות) או להחליף אותן בישנות?
id: Anotasi sudah ada di folder tujuan. Apakah Anda ingin menggunakan anotasi di folder tujuan (dan menghapus yang lama) atau menimpa anotasi di folder tujuan dengan yang lama?

# anyWordsSearchDesc
source: Searches for records containing at least one of the words or phrases separated by a comma (,). Records matching any of the entries will be included in the results. (e.g., زكاة ,الصوم)
ar: يبحث عن السجلات التي تحتوي على واحدة على الأقل من الكلمات أو العبارات المفصولة بفاصلة (،). تُدرج في النتائج السجلاتُ المطابقة لأي من المدخلات. (مثال: الصوم، زكاة)
he: מחפש רשומות שמכילות לפחות אחת מהמילים או הביטויים המופרדים בפסיק (,). רשומות שמתאימות לאחד הערכים ייכללו בתוצאות. (לדוגמה: زكاة ,الزكاة)
id: Mencari data yang mengandung setidaknya satu kata atau frasa yang dipisahkan dengan koma (,). Data yang cocok dengan salah satu entri akan ditampilkan dalam hasil pencarian. (contoh: زكاة ,الصوم)

# anyWordsSearchTitle
source: 3. Match Any Word
ar: ٣. تطابق أي كلمة
he: 3. התאמה לכל מילה
id: 3. Cocokkan Kata Apa pun

source: Appearance
ar: المظهر
he: מראה
id: Tampilan

source: Application Update
ar: تحديث التطبيق
he: עדכון אפליקציה
id: Pembaruan Aplikasi

# appNeedAccess
source: The application requires access to the SQLite Database folder to proceed.
ar: يتطلب التطبيق الوصول إلى مجلد قاعدة البيانات للمتابعة.
he: האפליקציה דורשת גישה לתיקיית מסד הנתונים SQLite כדי להמשיך.
id: Aplikasi memerlukan akses ke folder Database SQLite untuk melanjutkan.

source: Archive ID
ar: رقم الأرشيف
he: מזהה ארכיון
id: ID Arsip

source: Are you sure you want to delete the downloaded content for "%@"?
ar: هل أنت متأكد من أنك تريد حذف المحتوى الذي تم تنزيله لـ "%@"؟
he: האם למחוק את התוכן שהורד עבור "%@"?
id: Apakah Anda yakin ingin menghapus konten yang diunduh untuk "%@"?

source: Are you sure you want to delete the downloaded content for %lld books?
ar: هل أنت متأكد من أنك تريد حذف المحتوى الذي تم تنزيله لـ %lld من الكتب؟
he: האם למחוק את התוכן שהורד עבור %lld ספרים?
id: Apakah Anda yakin ingin menghapus konten yang diunduh untuk %lld kitab?

source: Ascending
ar: متصاعدا
he: עולה
id: Naik

source: Author
ar: مؤلف
he: מחבר
id: Penulis

source: Author Info
ar: معلومات المؤلف
he: פרטי מחבר
id: Info Penulis

source: Author Information
ar: معلومات المؤلف
he: מידע על המחבר
id: Informasi Penulis

source: Author Name
ar: اسم المؤلف
he: שם המחבר
id: Nama Penulis

source: Author Type
ar: نوع المؤلف
he: סוג מחבר
id: Tipe Penulis

source: Background
ar: الخلفية
he: רקע
id: Latar Belakang

source: Begin downloading...
ar: ابدأ في التنزيل...
he: מתחיל להוריד...
id: Mulai mengunduh...

source: Bi-Annual Routine Check until toggled off and on again.
ar: فحص دوري نصف سنوي حتى إيقاف المفتاح وإعادة تشغيله.
he: בדיקה דו-שנתית עד כיבוי והפעלה מחדש.
id: Pemeriksaan rutin setengah tahunan hingga tombol dinonaktifkan dan dinyalakan ulang.

source: Blue
ar: أزرق
he: כחול
id: Biru

source: Book
ar: الكتاب
he: ספר
id: Kitab

source: Book Info
ar: معلومات الكتاب
he: פרטי ספר
id: Info Kitab

source: Book Information
ar: معلومات الكتاب
he: מידע על הספר
id: Informasi Buku

source: Book Name (bk)
ar: اسم الكتاب (bk)
he: שם ספר (bk)
id: Nama Kitab (bk)

source: Book Type
ar: نوع الكتاب
he: סוג ספר
id: Tipe Kitab

# bookMissingOnAnnotationClick
source: The book for this annotation was not found. If this is an offline imported book, ensure you have also imported it on this device using the same ID as on your other device, or hide it via Settings.
ar: لم يتم العثور على الكتاب الخاص بهذه الملحوظة. إذا كان هذا الكتاب مستورداً يدوياً (Offline)، فيرجى التأكد من استيراده أيضاً على هذا الجهاز بنفس المعرف (ID) المستخدم في الجهاز الآخر، أو قم بإخفائه من الإعدادات.
he: הספר של הערה זו לא נמצא. אם זהו ספר שיובא לא מקוון, ודא שייבאת אותו גם במכשיר הזה עם אותו מזהה כמו במכשיר האחר, או הסתר אותו דרך ההגדרות.
id: Kitab untuk anotasi ini tidak ditemukan. Jika ini adalah kitab hasil import offline, pastikan Anda juga meng-import kitab tersebut di perangkat ini dengan id yang sama di perangkat lain, atau sembunyikan dari Pengaturan.

# bookNotFound
source: Book with ID %1$(bookID)lld not found.
ar: .لم يتم العثور pada الكتاب الذي يحمل المعرف %1$(bookID)lld
he: ספר עם מזהה %1$(bookID)lld לא נמצא.
id: Buku dengan ID %1$(bookID)lld tidak ditemukan.

source: Books Updates
ar: تحديثات الكتب
he: עדכוני ספרים
id: Pembaruan Kitab

# bulkBookDownloadAlert
source: Are you sure you want to download %1$(totalBook)lld books?
ar: هل أنت متأكد من أنك تريد تنزيل %1$(totalBook)lld كتاباً؟
he: האם להוריד %1$(totalBook)lld ספרים?
id: Apakah Anda yakin ingin mengunduh %1$(totalBook)lld buku?

source: Bundle Mode
ar: وضع الحزمة
he: מצב חבילה
id: Mode Bundel

source: Cancel
ar: انهاء
he: ביטול
id: Batalkan

source: Category
ar: الفئة
he: קטגוריה
id: Kategori

source: Category (cat)
ar: الفئة (cat)
he: קטגוריה (cat)
id: Kategori (cat)

source: Change Book ID
ar: تغيير رقم الكتاب
he: שנה מזהה ספר
id: Ubah ID Kitab

source: Check Again
ar: تحقق مرة أخرى
he: בדוק שוב
id: Periksa Lagi

# Check at Start
source: Check Updates when App Open
ar: تحديث تلقائي عند فتح التطبيق
he: בדוק עדכונים בפתיחת האפליקציה
id: Cek Pembaruan saat Aplikasi Dibuka

source: Checking...
ar: جاري التحقق...
he: בודק...
id: Memeriksa…

source: Choose Annotations Folder…
ar: اختر مجلد التعليقات...
he: בחר תיקיית הערות…
id: Pilih Folder Anotasi...

source: Choose Folder
ar: اختر المجلد
he: בחר תיקייה
id: Pilih Folder

source: Choose Library Folder…
ar: اختر مجلد المكتبة...
he: בחר תיקיית ספרייה…
id: Pilih Folder Perpustakaan...

source: Cleanup Downloaded Data (Bundle Mode)
ar: تنظيف البيانات التي تم تنزيلها (وضع الحزمة)
he: ניקוי נתונים שהורדו (מצב חבילה)
id: Bersihkan Data yang Diunduh (Mode Bundel)

source: Clear All
ar: مسح الكل
he: נקה הכל
id: Hapus Semua

source: Clear Selections
ar: مسح التحديدات
he: נקה בחירות
id: Hapus Pilihan

source: Click to select...
ar: انقر للاختيار...
he: לחץ כדי לבחור...
id: Klik untuk memilih...

source: Clickable Annotations
ar: تعليقات قابلة للنقر
he: הערות לחיצות
id: Anotasi yang Dapat Diklik

source: Close
ar: إغلاق
he: סגור
id: Tutup

source: Close Tab
ar: إغلاق علامة التبويب
he: סגור כרטיסייה
id: Tutup Tab

source: CloudKit token has been reset. Full sync will start.
ar: تم إعادة تعيين رمز CloudKit. ستبدأ المزامنة الكاملة.
he: אסימון CloudKit אופס. סנכרון מלא יתחיל.
id: Token CloudKit telah diatur ulang. Sinkronisasi penuh akan dimulai.

# Completed! %lld/%lld books successfully updated.
source: Completed! %1$lld/%2$lld books successfully updated.
ar: تمّت العملية! تمّ تحديث الكتب %1$lld/%2$lld بنجاح.
he: הושלם! %1$lld/%2$lld ספרים עודכנו בהצלחה.
id: Selesai! %1$lld/%2$lld kitab berhasil diperbarui.

# Confirm Download Message
source: Please download to access book.
ar: يرجى التنزيل للوصول إلى الكتاب.
he: יש להוריד כדי לגשת לספר.
id: Silakan unduh untuk mengakses kitab.

source: Contents
ar: المحتويات
he: תוכן
id: Daftar Isi

source: Context
ar: سياق
he: הקשר
id: Konteks

source: Converter Tool & Help
ar: أداة المحول والمساعدة
he: כלי המרה ועזרה
id: Alat Konverter & Bantuan

# convertImportHelpDesc
source: If your SQLite database doesn't match our required format, use our Web Converter tool to transform your files. Currently only .docx and .epub files are supported.
ar: إذا كانت قاعدة بيانات SQLite الخاصة بك لا تتطابق مع التنسيق المطلوب لدينا، فاستخدم أداة Web Converter لتحويل ملفاتك. حاليا يتم دعم ملفات .docx و.epub فقط.
he: אם מסד הנתונים SQLite שלך אינו תואם למבנה הנדרש, השתמש בכלי ההמרה באינטרנט כדי להמיר את הקבצים. כרגע נתמכים רק קובצי .docx ו-.epub.
id: Jika basis data SQLite Anda tidak sesuai dengan format yang kami butuhkan, gunakan alat Konverter Web kami untuk mengubah file Anda. Saat ini hanya file .docx dan .epub yang didukung.

# convertImportHelpTitle
source: Need Help?
ar: هل تحتاج إلى مساعدة؟
he: צריך עזרה?
id: Butuh Bantuan?

source: Copy
ar: نسخ
he: העתק
id: Salin

source: Copying tables and rebuilding FTS index...
ar: نسخ الجداول وإعادة بناء مؤشر FTS...
he: מעתיק טבלאות ובונה מחדש את אינדקס FTS...
id: Menyalin tabel dan membangun kembali indeks FTS...

source: Copy with Reference
ar: نسخ مع الإشارة المرجعية
he: העתק עם מקור
id: Salin dengan Referensi

# core.error.cancelled
source: Download cancelled.
ar: تم إلغاء التنزيل.
he: ההורדה בוטלה.
id: Unduhan dibatalkan.

# core.error.decompressionFailed
source: Failed to decompress “%1$@”: %2$@.
ar: فشل في فك الضغط “٪%1$@:%2$@.
he: נכשל חילוץ “%1$@”: %2$@.
id: Gagal dekompresi file “%1$@”: %2$@.

# core.error.destinationUnavailable
source: The destination folder could not be created.
ar: تعذر إنشاء مجلد الوجهة.
he: לא ניתן ליצור את תיקיית היעד.
id: Folder tujuan tidak dapat dibuat.

# core.error.downloadFailed
source: File “%@” is incomplete after download.
ar: الملف “%@” غير مكتمل بعد التنزيل.
he: הקובץ “%@” אינו שלם לאחר ההורדה.
id: File “%@“ tidak lengkap setelah diunduh.

# core.error.httpStatus
source: Failed to download “%1$@” (HTTP %2$lld).
ar: فشل تنزيل “%1$@” (HTTP %2$lld).
he: נכשלה הורדת “%1$@” (HTTP %2$lld).
id: Gagal mengunduh “%1$@” (HTTP %2$lld).

# core.error.invalidBaseURL
source: Invalid download URL. Please check your configuration.
ar: عنوان URL للتنزيل غير صالح. يرجى التحقق من التكوين الخاص بك.
he: כתובת ההורדה אינה תקינה. בדוק את ההגדרות.
id: URL unduhan tidak valid. Silakan periksa konfigurasi Anda.

# core.error.invalidResponse
source: Invalid server response.
ar: استجابة الخادم غير صالحة.
he: תגובת שרת לא תקינה.
id: Respons server tidak valid.

# core.modal.downloading
source: Downloading database. Please wait…
ar: تنزيل قاعدة البيانات. من فضلك انتظر...
he: מוריד מסד נתונים. נא להמתין...
id: Mengunduh basis data. Mohon tunggu...

# core.modal.message
source: Application requires the main database file (~17,96 MB) that is downloaded once when first opened. The file will be saved in the Application Support folder.
ar: يتطلب التطبيق ملف قاعدة البيانات الرئيسي (~ 17,96 ميغابايت) الذي يتم تنزيله مرة واحدة عند فتحه لأول مرة. سيتم حفظ الملف في مجلد دعم التطبيقات.
he: האפליקציה דורשת את קובץ מסד הנתונים הראשי (~17.96 MB), שיורד פעם אחת בפתיחה הראשונה. הקובץ יישמר בתיקיית התמיכה של האפליקציה.
id: Maktabah memerlukan file database utama (~17,96 MB) yang diunduh sekali saat pertama kali dibuka. File akan disimpan di folder Application Support.

# core.modal.message.downloadsize
source: This app needs the core database files (%@) before the library can be used.
ar: يحتاج هذا التطبيق إلى ملفات قاعدة البيانات الأساسية (%@) قبل استخدام المكتبة.
he: האפליקציה זקוקה לקבצי מסד הנתונים הבסיסיים (%@) לפני שניתן להשתמש בספרייה.
id: Aplikasi ini membutuhkan file basis data inti (%@) sebelum perpustakaan dapat digunakan.

# core.modal.missingFiles.message
source: The selected folder doesn’t contain “Files/main.sqlite” and “Files/special.sqlite”. Choose another folder or download the core database.
ar: لا يحتوي المجلد المحدد على "Files/main.sqlite" و"Files/special.sqlite". اختر مجلدا آخر أو قم بتنزيل قاعدة البيانات الأساسية.
he: התיקייה שנבחרה אינה מכילה את “Files/main.sqlite” ואת “Files/special.sqlite”. בחר תיקייה אחרת או הורד את מסד הנתונים הבסיסי.
id: Folder yang dipilih tidak berisi "Files/main.sqlite" dan "Files/special.sqlite". Pilih folder lain atau unduh basis data inti.

# core.modal.missingFiles.title
source: Database files not found
ar: لم يتم العثور على ملفات قاعدة البيانات
he: קבצי מסד הנתונים לא נמצאו
id: File basis data tidak ditemukan

# core.modal.title
source: Database File Needed
ar: ملف قاعدة البيانات مطلوب
he: נדרש קובץ מסד נתונים
id: Database Diperlukan

source: Create
ar: إنشاء
he: צור
id: Buat

source: Create Folder
ar: إنشاء مجلد
he: צור תיקייה
id: Buat Folder

source: Create New Folder
ar: إنشاء مجلد جديد
he: צור תיקייה חדשה
id: Buat Folder Baru

source: Cross-Platform Sync
ar: المزامنة عبر الأنظمة الأساسية
id: Sinkronisasi Lintas-Platform

source: Current
ar: تيار
he: נוכחי
id: Saat ini

source: Database connection is not available.
ar: الاتصال بقاعدة البيانات غير متاح.
he: חיבור מסד הנתונים אינו זמין.
id: Koneksi Database tidak tersedia.

source: Database Mode
ar: وضع قاعدة البيانات
he: מצב מסד נתונים
id: Mode Basis Data

source: Date Created
ar: تاريخ الإنشاء
he: תאריך יצירה
id: Tgl. Dibuat

source: Date Modified
ar: تاريخ التعديل
id: Tangal Dimodifikasi

source: Death Year
ar: سنة الوفاة
he: שנת פטירה
id: Tahun Wafat

source: Delete
ar: حذف
he: מחק
id: Hapus

source: Delete %@
ar: حذف %@
he: מחק %@
id: Hapus %@

source: Delete Annotation
ar: حذف التعليق التوضيحي
he: מחק הערה
id: Hapus Anotasi

source: Delete Download
ar: حذف التنزيل
he: מחיקת הורדה
id: Hapus Unduhan

source: Delete Folder
ar: حذف المجلد
he: מחק תיקייה
id: Hapus Folder

source: Delete Font
ar: حذف الخط
he: מחק גופן
id: Hapus Font

source: Delete Highlight
ar: حذف التمييز
he: מחק הדגשה
id: Hapus Sorotan

source: Delete Highlight & Note
ar: حذف التمييز والملاحظة
he: מחק הדגשה והערה
id: Hapus Sorotan & Catatan

source: Delete Tag
ar: حذف العلامة
he: מחק תגית
id: Hapus Tag

source: Delete Tag & Annotation
ar: حذف العلامة والتعليق
he: מחק תגית והערה
id: Hapus Tag & Anotasi

source: Descending
ar: ترتيبا تنازليا
he: יורד
id: Turun

source: Display
ar: العرض
he: תצוגה
id: Tampilan

source: Done
ar: تم بنجاح
he: סיום
id: Selesai

source: Download
ar: تنزيل
he: הורדה
id: Unduh

source: Download Book
ar: تحميل الكتاب
he: הורדת ספר
id: Unduh Kitab

source: Download Complete. Begin integrating...
ar: اكتمل التنزيل. ابدأ في دمج...
he: ההורדה הושלמה. מתחיל לשלב...
id: Unduh Selesai. Mulai mengintegrasikan...

source: Download Failed
ar: فشل التنزيل
he: ההורדה נכשלה
id: Unduhan Gagal

source: Download Full Library (Google Drive)
ar: قم بتنزيل المكتبة الكاملة (Google Drive)
he: הורד ספרייה מלאה (Google Drive)
id: Unduh Perpustakaan Lengkap (Google Drive)

# Download phase completed (%lld/%lld). Starting processing...
source: Download phase completed (%1$lld/%2$lld). Starting processing...
ar: اكتملت مرحلة التنزيل (%1$lld/%2$lld). بدء المعالجة...
he: שלב ההורדה הושלם (%1$lld/%2$lld). מתחיל לעבד...
id: Fase unduhan selesai (%1$lld/%2$lld). Memulai proses…

source: Downloaded
ar: تم تنزيله
he: הורדו
id: Diunduh

source: Downloading
ar: تحميل
he: מוריד
id: Mengunduh

# Downloading %lld of %lld books...
source: Downloading %1$lld of %2$lld books...
ar: تنزيل %1$lld من كتب %2$lld...
he: מוריד %1$lld מתוך %2$lld ספרים...
id: Mengunduh %1$lld dari %2$lld kitab…

source: Downloading book file from server...
ar: تنزيل ملف الكتاب من الخادم...
he: מוריד קובץ ספר מהשרת...
id: Mengunduh file kitab dari server...

# Downloading books... (%lld/%lld)
source: Downloading books... (%1$lld/%2$lld)
ar: تنزيل الكتب... (%1$lld/%2$lld)
he: מוריד ספרים... (%1$lld/%2$lld)
id: Mengunduh kitab… (%1$lld/%2$lld)

source: Downloading...
ar: جاري التنزيل...
he: מוריד...
id: Mengunduh...

source: Downloads
ar: التنزيلات
he: הורדות
id: Unduhan

source: e.g., %lld
ar: مثال، %lld
he: לדוגמה, %lld
id: contoh, %lld

source: e.g., 256 AH
ar: مثال: ٢٥٦ هـ
id: misal: 256 H

source: e.g., 32793
ar: مثال، 32793
id: contoh, 32793

source: e.g., Al-Bukhari
ar: مثال: البخاري
id: misal: Al-Bukhari

source: e.g., Sahih Bukhari
ar: مثال: صحيح البخاري
id: misal: Sahih Bukhari

source: Edit Annotation
ar: تعديل التعليق
he: ערוך הערה
id: Edit Anotasi

source: Edit Note
ar: تعديل الملاحظة
he: ערוך הערה
id: Edit Catatan

source: Edition
ar: الطبعة
he: מהדורה
id: Edisi

# errorCreateFolderDesc
source: Folder name already exist.
ar: إسم المجلد موجود بالفعل.
he: שם התיקייה כבר קיים.
id: Nama folder sudah ada.

# errorCreateFolderTitle
source: Error when trying to create folder.
ar: حدث خطأ عند إنشاء المجلد.
he: שגיאה בעת ניסיון ליצור תיקייה.
id: Error ketika mencoba membuat folder.

# errorCreateInFolderDesc
source: Folder name already exist in selected folder.
ar: إسم المجلد موجود بالفعل في المجلد المحدد.
he: שם התיקייה כבר קיים בתיקייה שנבחרה.
id: Nama folder sudah ada di folder yang terpilih.

# errorFolderAnnotations
source: Annotations Folder Not Found
ar: مجلد التعليقات غير موجود
he: תיקיית ההערות לא נמצאה
id: Folder Anotasi Tidak Ditemukan

# errorFolderSearchResults
source: Search Results Folder Not Found
ar: مجلد نتائج البحث غير موجود
he: תיקיית תוצאות החיפוש לא נמצאה
id: Folder Hasil Pencarian Tidak Ditemukan

# errorICloud
source: An error occurred when trying to download a file in iCloud Drive
ar: حدث خطأ أثناء محاولة تنزيل ملف في iCloud Drive
he: אירעה שגיאה בעת ניסיון להוריד קובץ מ-iCloud Drive
id: Terjadi kesalahan saat mencoba mengunduh file di iCloud Drive

# errorMovingFolderDesc
source: Folder name already exist in folder destination.
ar: إسم المجلد موجود بالفعل في مجلد الوجهة.
he: שם התיקייה כבר קיים בתיקיית היעד.
id: Nama folder sudah ada di folder tujuan.

# errorMovingFolderTitle
source: Error when trying to move folder.
ar: حدث خطأ عند محاولة نقل المجلد.
he: שגיאה בעת ניסיון להעביר תיקייה.
id: Error ketika mencoba memindahkan folder.

# errorMovingResultDesc
source: Result name already exist in folder destination.
ar: إسم نتيجة البحث موجود بالفعل في مجلد الوجهة.
he: שם התוצאה כבר קיים בתיקיית היעד.
id: Nama hasil pencarian sudah ada di folder tujuan.

# errorMovingResultTitle
source: Error when trying to move results.
ar: حدث خطأ عند محاولة نقل نتائج البحث.
he: שגיאה בעת ניסיון להעביר תוצאות.
id: Error ketika mencoba memindahkan hasil pencarian.

# errorSavedResultDesc
source: Result name already exist in currrent folder.
ar: إسم نتيجة البحث موجود بالفعل في المجلد الحالي.
he: שם התוצאה כבר קיים בתיקייה הנוכחית.
id: Nama folder sudah ada di folder saat ini.

# errorSaveResultDesc
source: Result name already exist in currrent folder.
ar: إسم نتيجة البحث موجود بالفعل في المجلد الحالي.
he: שם התוצאה כבר קיים בתיקייה הנוכחית.
id: Nama folder sudah ada di folder saat ini.

# errorSaveResultTitle
source: Error when trying to save results.
ar: حدث خطأ عند محاولة حفظ النتائج.
he: שגיאה בעת ניסיון לשמור תוצאות.
id: Error ketika mencoba menyimpan hasil pencarian.

# errorUpdateFolderOrResultDesc
source: New name already exist.
ar: الإسم الجديد موجود بالفعل.
he: השם החדש כבר קיים.
id: Nama baru sudah ada.

# errorUpdateFolderTitle
source: Unable to rename folder.
ar: تعذر إعادة تسمية المجلد.
he: לא ניתן לשנות את שם התיקייה.
id: Tidak dapat mengubah nama folder.
